In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
   'name':['george','pranjal','mayank','rajjwal','divya'],
   'marks':[99,95,98,96,84],
   'city':['prayahraj','mirzapur','allapur','daraganj','daraganj']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df.head()

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur
2   mayank     98    allapur
3  rajjwal     96   daraganj
4    divya     84   daraganj

In [6]:
df.head(2)

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur

In [7]:
df.to_csv("first.csv")

In [8]:
df.to_csv('second.csv', index = False)

In [9]:
df.tail(2)

      name  marks      city
3  rajjwal     96  daraganj
4    divya     84  daraganj

In [10]:
df.describe()

           marks
count   5.000000
mean   94.400000
std     6.024948
min    84.000000
25%    95.000000
50%    96.000000
75%    98.000000
max    99.000000

In [11]:
train = pd.read_csv("train.csv")

In [12]:
train

   train_no.  speed       city
0      12792     23  prayahraj
1      12342    343   mirzapur
2      23442     43    allapur
3      34323    433   daraganj
4      23442     86   daraganj

In [13]:
train["speed"]

0     23
1    343
2     43
3    433
4     86
Name: speed, dtype: int64

In [14]:
train["speed"][0]

23

In [15]:
train['speed'][0]=100

C:\Users\georg\AppData\Local\Temp\ipykernel_16956\2570865288.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][0]=100

In [16]:
train

   train_no.  speed       city
0      12792    100  prayahraj
1      12342    343   mirzapur
2      23442     43    allapur
3      34323    433   daraganj
4      23442     86   daraganj

In [17]:
train.to_csv("csv2.csv")

In [18]:
train.to_csv('csv2.csv',index=False)

In [19]:
train.index=['one','two','three','four','five']

In [20]:
train

       train_no.  speed       city
one        12792    100  prayahraj
two        12342    343   mirzapur
three      23442     43    allapur
four       34323    433   daraganj
five       23442     86   daraganj

In [23]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [24]:
newdf

            0         1         2         3         4
0    0.092740  0.618736  0.017682  0.390047  0.760167
1    0.120932  0.438079  0.936105  0.621723  0.325272
2    0.360317  0.563477  0.908184  0.057893  0.250771
3    0.865644  0.714359  0.306920  0.580846  0.930525
4    0.378866  0.579818  0.478209  0.200728  0.286324
..        ...       ...       ...       ...       ...
329  0.541777  0.920363  0.703212  0.407192  0.320187
330  0.241111  0.135075  0.367642  0.401016  0.229821
331  0.279049  0.966647  0.321615  0.448743  0.564080
332  0.134599  0.371699  0.949768  0.279973  0.615488
333  0.529647  0.473166  0.318243  0.555251  0.469057

[334 rows x 5 columns]

In [28]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.092740  0.618736  0.017682  0.390047  0.760167
1  0.120932  0.438079  0.936105  0.621723  0.325272
2  0.360317  0.563477  0.908184  0.057893  0.250771
3  0.865644  0.714359  0.306920  0.580846  0.930525
4  0.378866  0.579818  0.478209  0.200728  0.286324

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.495241    0.510913    0.497734    0.479973    0.483067
std      0.281762    0.286210    0.288232    0.287969    0.282011
min      0.011536    0.001973    0.002032    0.002738    0.003703
25%      0.242722    0.250766    0.257187    0.218465    0.244466
50%      0.488729    0.509459    0.494545    0.462958    0.474979
75%      0.736565    0.758577    0.752268    0.730286    0.724701
max      0.998146    0.996108    0.996263    0.999239    0.998103

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf.head()

          0         1         2         3         4
0  0.092740  0.618736  0.017682  0.390047  0.760167
1  0.120932  0.438079  0.936105  0.621723  0.325272
2  0.360317  0.563477  0.908184  0.057893  0.250771
3  0.865644  0.714359  0.306920  0.580846  0.930525
4  0.378866  0.579818  0.478209  0.200728  0.286324

In [33]:
newdf.sort_index(axis = 0, ascending = False)

            0         1         2         3         4
333  0.529647  0.473166  0.318243  0.555251  0.469057
332  0.134599  0.371699  0.949768  0.279973  0.615488
331  0.279049  0.966647  0.321615  0.448743  0.564080
330  0.241111  0.135075  0.367642  0.401016  0.229821
329  0.541777  0.920363  0.703212  0.407192  0.320187
..        ...       ...       ...       ...       ...
4    0.378866  0.579818  0.478209  0.200728  0.286324
3    0.865644  0.714359  0.306920  0.580846  0.930525
2    0.360317  0.563477  0.908184  0.057893  0.250771
1    0.120932  0.438079  0.936105  0.621723  0.325272
0    0.092740  0.618736  0.017682  0.390047  0.760167

[334 rows x 5 columns]

In [34]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0    0.092740  0.618736  0.017682  0.390047  0.760167
1    0.120932  0.438079  0.936105  0.621723  0.325272
2    0.360317  0.563477  0.908184  0.057893  0.250771
3    0.865644  0.714359  0.306920  0.580846  0.930525
4    0.378866  0.579818  0.478209  0.200728  0.286324
..        ...       ...       ...       ...       ...
329  0.541777  0.920363  0.703212  0.407192  0.320187
330  0.241111  0.135075  0.367642  0.401016  0.229821
331  0.279049  0.966647  0.321615  0.448743  0.564080
332  0.134599  0.371699  0.949768  0.279973  0.615488
333  0.529647  0.473166  0.318243  0.555251  0.469057

[334 rows x 5 columns]>

In [35]:
newdf.head()

          0         1         2         3         4
0  0.092740  0.618736  0.017682  0.390047  0.760167
1  0.120932  0.438079  0.936105  0.621723  0.325272
2  0.360317  0.563477  0.908184  0.057893  0.250771
3  0.865644  0.714359  0.306920  0.580846  0.930525
4  0.378866  0.579818  0.478209  0.200728  0.286324

In [37]:
newdf2 = newdf

In [40]:
newdf2[0][0]= 222

In [41]:
newdf.head()

            0         1         2         3         4
0  222.000000  0.618736  0.017682  0.390047  0.760167
1    0.120932  0.438079  0.936105  0.621723  0.325272
2    0.360317  0.563477  0.908184  0.057893  0.250771
3    0.865644  0.714359  0.306920  0.580846  0.930525
4    0.378866  0.579818  0.478209  0.200728  0.286324

In [42]:
newdf.columns = list('ABCDE')

In [43]:
newdf.head()

            A         B         C         D         E
0  222.000000  0.618736  0.017682  0.390047  0.760167
1    0.120932  0.438079  0.936105  0.621723  0.325272
2    0.360317  0.563477  0.908184  0.057893  0.250771
3    0.865644  0.714359  0.306920  0.580846  0.930525
4    0.378866  0.579818  0.478209  0.200728  0.286324

In [51]:
newdf.loc[0,'A']= 443

In [52]:
newdf.head()

            A         B         C         D         E      0
0  443.000000  0.618736  0.017682  0.390047  0.760167  443.0
1    0.120932  0.438079  0.936105  0.621723  0.325272    NaN
2    0.360317  0.563477  0.908184  0.057893  0.250771    NaN
3    0.865644  0.714359  0.306920  0.580846  0.930525    NaN
4    0.378866  0.579818  0.478209  0.200728  0.286324    NaN

In [53]:
newdf.drop(0,axis=1)

              A         B         C         D         E
0    443.000000  0.618736  0.017682  0.390047  0.760167
1      0.120932  0.438079  0.936105  0.621723  0.325272
2      0.360317  0.563477  0.908184  0.057893  0.250771
3      0.865644  0.714359  0.306920  0.580846  0.930525
4      0.378866  0.579818  0.478209  0.200728  0.286324
..          ...       ...       ...       ...       ...
329    0.541777  0.920363  0.703212  0.407192  0.320187
330    0.241111  0.135075  0.367642  0.401016  0.229821
331    0.279049  0.966647  0.321615  0.448743  0.564080
332    0.134599  0.371699  0.949768  0.279973  0.615488
333    0.529647  0.473166  0.318243  0.555251  0.469057

[334 rows x 5 columns]

In [56]:
newdf.loc[[1,2,3],['C','D']]

          C         D
1  0.936105  0.621723
2  0.908184  0.057893
3  0.306920  0.580846

In [58]:
newdf.loc[:,['C','D']]

            C         D
0    0.017682  0.390047
1    0.936105  0.621723
2    0.908184  0.057893
3    0.306920  0.580846
4    0.478209  0.200728
..        ...       ...
329  0.703212  0.407192
330  0.367642  0.401016
331  0.321615  0.448743
332  0.949768  0.279973
333  0.318243  0.555251

[334 rows x 2 columns]

In [59]:
newdf.head()

            A         B         C         D         E      0
0  443.000000  0.618736  0.017682  0.390047  0.760167  443.0
1    0.120932  0.438079  0.936105  0.621723  0.325272    NaN
2    0.360317  0.563477  0.908184  0.057893  0.250771    NaN
3    0.865644  0.714359  0.306920  0.580846  0.930525    NaN
4    0.378866  0.579818  0.478209  0.200728  0.286324    NaN

In [64]:
newdf.loc[(newdf['A']>0.99)]

              A         B         C         D         E      0
0    443.000000  0.618736  0.017682  0.390047  0.760167  443.0
48     0.994244  0.788796  0.996263  0.866909  0.717855    NaN
105    0.998146  0.105030  0.634545  0.709035  0.247577    NaN
177    0.992819  0.291368  0.573884  0.996135  0.182080    NaN
278    0.992380  0.778355  0.977008  0.617452  0.037038    NaN

In [78]:
newdf.loc[(newdf['B']>0.7) & (newdf['B']>0.3)]

            A         B         C         D         E   0
3    0.865644  0.714359  0.306920  0.580846  0.930525 NaN
9    0.527598  0.978789  0.107635  0.419862  0.357180 NaN
11   0.097552  0.925379  0.569539  0.261981  0.012897 NaN
15   0.709636  0.897678  0.187191  0.878228  0.411326 NaN
16   0.401028  0.912541  0.779797  0.503842  0.518546 NaN
..        ...       ...       ...       ...       ...  ..
321  0.528656  0.980175  0.792311  0.913307  0.467800 NaN
326  0.925446  0.885364  0.219866  0.279116  0.964375 NaN
328  0.482134  0.934167  0.993213  0.800599  0.780426 NaN
329  0.541777  0.920363  0.703212  0.407192  0.320187 NaN
331  0.279049  0.966647  0.321615  0.448743  0.564080 NaN

[105 rows x 6 columns]

In [82]:
newdf.drop('E', axis = 1)

              A         B         C         D      0
0    443.000000  0.618736  0.017682  0.390047  443.0
1      0.120932  0.438079  0.936105  0.621723    NaN
2      0.360317  0.563477  0.908184  0.057893    NaN
3      0.865644  0.714359  0.306920  0.580846    NaN
4      0.378866  0.579818  0.478209  0.200728    NaN
..          ...       ...       ...       ...    ...
329    0.541777  0.920363  0.703212  0.407192    NaN
330    0.241111  0.135075  0.367642  0.401016    NaN
331    0.279049  0.966647  0.321615  0.448743    NaN
332    0.134599  0.371699  0.949768  0.279973    NaN
333    0.529647  0.473166  0.318243  0.555251    NaN

[334 rows x 5 columns]

In [84]:
newdf.loc[(newdf['A']>0.3)]

              A         B         C         D         E      0
0    443.000000  0.618736  0.017682  0.390047  0.760167  443.0
2      0.360317  0.563477  0.908184  0.057893  0.250771    NaN
3      0.865644  0.714359  0.306920  0.580846  0.930525    NaN
4      0.378866  0.579818  0.478209  0.200728  0.286324    NaN
5      0.326249  0.646539  0.006005  0.028894  0.223647    NaN
..          ...       ...       ...       ...       ...    ...
325    0.646930  0.510075  0.207570  0.750035  0.850670    NaN
326    0.925446  0.885364  0.219866  0.279116  0.964375    NaN
328    0.482134  0.934167  0.993213  0.800599  0.780426    NaN
329    0.541777  0.920363  0.703212  0.407192  0.320187    NaN
333    0.529647  0.473166  0.318243  0.555251  0.469057    NaN

[235 rows x 6 columns]

In [85]:
newdf.iloc[1,3]

0.6217227005468936

In [87]:
newdf.iloc[[2,3,4,5],[2,3,4]]

          C         D         E
2  0.908184  0.057893  0.250771
3  0.306920  0.580846  0.930525
4  0.478209  0.200728  0.286324
5  0.006005  0.028894  0.223647

In [88]:
newdf.head()

            A         B         C         D         E      0
0  443.000000  0.618736  0.017682  0.390047  0.760167  443.0
1    0.120932  0.438079  0.936105  0.621723  0.325272    NaN
2    0.360317  0.563477  0.908184  0.057893  0.250771    NaN
3    0.865644  0.714359  0.306920  0.580846  0.930525    NaN
4    0.378866  0.579818  0.478209  0.200728  0.286324    NaN

In [93]:
newdf.drop(['A','B'],axis=1,inplace= True)